EDT/УТ/src/Catalogs/новаТочкиДоставки/новаТочкиДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаТочкиДоставки</name>
  <attributes>
    <name>ВладелецТочки</name>
    <type>
      <types>CatalogRef.новаКонтрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>CatalogRef.новаАдреса</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПребывания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыНачало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыОкончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СменаПланирования</name>
    <type>
      <types>CatalogRef.новаСменыПланирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособыДоставкиЗаполнены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбранныхКатегорий</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РежимПосещения</name>
    <type>
      <types>CatalogRef.новаРежимыПосещенияТочекДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Радиус</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗонПогрузкиРазгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНахождениеТранспортаВРадиусе</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.новаПриоритетыТочкиДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресИзЯндекса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Москва</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ГрафикРаботы</name>
    <attributes>
      <name>Используется</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Выходной</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПребывания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КатегорииТранспорта</name>
    <attributes>
      <name>ЗначениеКатегории</name>
      <type>
        <types>CatalogRef.новаЗначенияКатегорийТранспорта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъемВывоза</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.новаНоменклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <types>CatalogRef.новаЕдиницыНоменклатуры</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/новаГеоРайоны/новаГеоРайоны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>новаГеоРайоны</name>
  <owners>Catalog.новаКлассификаторРайонов</owners>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Точки</name>
    <attributes>
      <name>Широта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ребра</name>
    <attributes>
      <name>Широта1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Широта2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Долгота2</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>17</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/новаТочкиДоставки/ObjectModule.bsl
//**** Вспомогательные функции ****//

// Заполняет незаполненные параметры точки доставки по умолчанию.
//
Процедура ЗаполнитьПараметры() Экспорт
	Если Не ЗначениеЗаполнено(ГрафикРаботы) Тогда
		ЗаполнитьГрафик(Константы.новаТочкаДоставкиГрафикРаботыПоУмолчанию.Получить());
	КонецЕсли;		
	
	Если Не ЗначениеЗаполнено(ВремяПребывания) Тогда
		ВремяПребывания = Константы.новаТочкаДоставкиВремяПребыванияПоУмолчанию.Получить();
	КонецЕсли;		
	
	Если Не ЗначениеЗаполнено(ВремяРаботыНачало) Тогда
		ВремяРаботыНачало = Константы.новаТочкаДоставкиВремяРаботыНачалоПоУмолчанию.Получить();
	КонецЕсли;		
	
	Если Не ЗначениеЗаполнено(ВремяРаботыОкончание) Тогда
		ВремяРаботыОкончание = Константы.новаТочкаДоставкиВремяРаботыОкончаниеПоУмолчанию.Получить();
	КонецЕсли;		
	
	Если Не ЗначениеЗаполнено(СменаПланирования) Тогда
		СменаПланирования = Константы.новаТочкаДоставкиСменаПланированияПоУмолчанию.Получить();
	КонецЕсли;		
КонецПроцедуры

// Возвращает окно доставки на заданную дату, из графика работы точки.
//
// Параметры:
//  НаДату <Дата>
//
// Возвращаемое значение:
//  <Структура(ВремяНачала, ВремяОкончания, ВремяПребывания: <Дата>)>
//
Функция ПолучитьОкноДоставки(НаДату) Экспорт
	ДеньГрафика = ДеньНедели(НаДату) - 1;
	Если ДеньГрафика < ГрафикРаботы.Количество() Тогда
		стрДеньГрафика = ГрафикРаботы[ДеньГрафика];
		Если стрДеньГрафика.Используется Тогда
			Возврат Новый Структура("ВремяНачала, ВремяОкончания, ВремяПребывания",
				стрДеньГрафика.ВремяНачала,
				стрДеньГрафика.ВремяОкончания,
				стрДеньГрафика.ВремяПребывания);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Новый Структура("ВремяНачала, ВремяОкончания, ВремяПребывания",
		ВремяРаботыНачало,
		ВремяРаботыОкончание,
		ВремяПребывания);
КонецФункции
	
// Заполняет индивидуальный график работы точки по типовому графику работы.
//
// Параметры:
//  График <СправочникСсылка.новаГрафикиРаботы>
//
Процедура ЗаполнитьГрафик(График) Экспорт
	Если Не ЗначениеЗаполнено(График) Тогда Возврат; КонецЕсли; 
	
	ГрафикРаботы.Очистить();
	Для ъ = 0 По 6 Цикл
		стрДень = ГрафикРаботы.Добавить();
		ЗаполнитьЗначенияСвойств(стрДень, График.Дни[ъ % График.Дни.Количество()]);
		стрДень.Используется = Истина;
	КонецЦикла;
КонецПроцедуры

//**** Обработчики событий объекта ****//

//Заполнение графика работы
//
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	Конецесли;

	Если ГрафикРаботы.Количество() = 0 Тогда
		ЗаполнитьГрафик(Константы.новаТочкаДоставкиГрафикРаботыПоУмолчанию.Получить());
	КонецЕсли;
	
	//Бухаров 03.09.2013
	Если ЗначениеЗаполнено(Адрес) И ЗначениеЗаполнено(Адрес.Широта) И ЗначениеЗаполнено(Адрес.Долгота) Тогда
		Москва = Справочники.новаГеоРайоны.ОпределениеМосквы(Адрес.Широта, Адрес.Долгота);	
	КонецЕсли;
	//Бухаров

КонецПроцедуры

//Синхронизация с КСЛ
//
Процедура ПриЗаписи(Отказ)
//херим нова	
	//Попытка
	//	новаОбменКСЛ.СохранитьТочкуДоставки(ЭтотОбъект);
	//Исключение
	//	#Если Клиент Тогда			
	//		новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
	//	#КонецЕсли
	//	Отказ = Истина;
	//КонецПопытки;
	//херим нова	
КонецПроцедуры

//Синхронизация с КСЛ
//
Процедура ПередУдалением(Отказ)
//херим нова	
	//Попытка
	//	новаОбменКСЛ.УдалитьТочкуДоставки(ЭтотОбъект);
	//Исключение
	//	#Если Клиент Тогда			
	//		новаОбщиеПроцедуры.СообщитьПользователюОбОшибке("ВнутренняОшибкаСервера", ОписаниеОшибки());
	//	#КонецЕсли
	//	Отказ = Истина;
	//КонецПопытки;
//херим нова	
КонецПроцедуры
